print("=== Урок 1 Базовые струкуры данных====")
print(" Целое число 5 - ",5) # Целое число d python
print(" Тип целого числа - ", type(5)) # Целое число тип в python
print(" Сложение 5+5 =" , str(5+5)) # Сложение в python
print(" Вычитание 5-5 =" , str(5-5)) # Вычитание в python
print(" Умножение 5*5 =" , str(5*5)) # Умножение в python
print(" Возведение в степень два 5**2 =" , str(5**2)) # Возведение в степень в python
print(" Простое деление 5/5 =" , str(5/5)) # Простое деление в python
print(" Целочисленное деление 5//5 =" , str(5//5)) # Целочисленное деление в python
print(" Остаток от целочисленного деления 7%5 =" , str(7%5)) # Остаток от целочисленного деления в python
print(" Дробное число - " , str(2.0)) # Дробное число в python
print(" Тип дробного числа - ", type(2.0)) # Дробное число тип в python