print("=== Урок 1 Базовые струкуры данных====")
print(" === Целые числа ===")
print(" Целое число 5 - ",5) # Целое число в python
print(" Тип целого числа - ", type(5)) # Целое число тип в python
print(" Сложение 5+5 =" , str(5+5)) # Сложение в python
print(" Вычитание 5-5 =" , str(5-5)) # Вычитание в python
print(" Умножение 5*5 =" , str(5*5)) # Умножение в python
print(" Возведение в степень два 5**2 =" , str(5**2)) # Возведение в степень в python
print(" Простое деление 5/5 =" , str(5/5)) # Простое деление в python
print(" Целочисленное деление 5//5 =" , str(5//5)) # Целочисленное деление в python
print(" Остаток от целочисленного деления 7%5 =" , str(7%5)) # Остаток от целочисленного деления в python
print(" === Дробные числа ===")
print(" Дробное число - " , str(2.0)) # Дробное число в python
print(" Тип дробного числа - ", type(2.0)) # Дробное число тип в python
print(" Сложение 2.0+2.0 =" , str(2.0+2.0)) # Сложение в python
print(" Сложение 2.0+2 =" , str(2.0+2)) # Сложение в python
print(" === Строки ===")
print(" Hello World! ") # Строка в python
print(" Тип строки - ", type("Hello world!")) # Строка тип в python
print(" Конкатенация сток Hello и Word и ! =" , 'Hello ' + 'world' + '!') # Конкатенация строк в python
print(" Конкатенация 1 и 1 =" , '1' + '1') # Конкатенация строк в python
print(" === Логический тип данных ===\n")
print(" Логические данные True и False - ",True,False) # Логические данные в python
print(" Тип логических данных True и False- ", type(True), type(False)) # Логический тип в python
print(" Применение логических данных : 5 > 10 и 10 > 5 - ", 5 > 10, 10 > 5 ) # Примеры применения логических данных тип в python
print(" Применение логических данных : 5==5 и 5 != 5 - ", 5 == 5, 5 != 5 ) # Примеры применения логических данных тип в python
print(" Применение логических данных : (5==5 and 5 < 10) - ", (5 == 5 and 5 < 10) ) # Примеры применения логических данных тип в python
print(" Применение логических данных : (5==5  5 < 10) - ", (5 == 5 and 5 < 10) ) # Примеры применения логических данных тип в python
print(" === Преобразование типов ===")
print(" Преобразование str - > int ", str(int('5'))) # Преобразование типов в python
print(" Проверка преобразования типа str - > int ", str(type(int('5')))) # Преобразование типов в python
