print("=== Урок 1 Базовые струкуры данных====")
print("Число 5 - ",5) # Просто число
print("Тип числа - ", type(5)) # Числовой тип в python
print(" Сложение 5+5 =" , str(5+5)) # Сложение в python
print(" Вычитание 5-5 =" , str(5-5)) # Вычитание в python
print(" Умножение 5*5 =" , str(5*5)) # Умножение в python
print(" Простое деление 5/5 =" , str(5/5)) # Простое деление в python
print(" Целочисленное деление 5//5 =" , str(5//5)) # Целочисленное деление в python
print(" Остаток от целочисленного деления 7%5 =" , str(7%5)) # Остаток от целочисленного деления в python