print("=== Переменные ===")
# Напишите 4 переменных которые буду обозначать следующие данные:
dz_count = 12 # Количество выполненных ДЗ (запишите значение 12)
time_length = 1.5 # Количество затраченных часов (запишите значение 1.5)
name_of_course = 'Python' # (запишите значение 'Python')
time_per_course = time_length / dz_count # Время на одно задание (вычислить используя 1 и 2 переменные)
print ( "Python, всего задач:", str(dz_count) + ",", "затрачено часов:", str(time_length)+",", "среднее время выполнения:",
        time_per_course,"часа.") # Выведите на экран(в консоль), используя переменные



