print("=== Динамическая типизация ===")
name="Александр" # Создайте переменную name и присвойте ей значение вашего имени (строка).
print("Name:",name,type(name)) # Выведите значение переменной name на экран.
age=53 # Создайте переменную age и присвойте ей значение вашего возраста (целое число).
print("Age:",age,type(age)) # Выведите значение переменной age на экран.
age = age + 10 #  Перезапишите в age текущее значение переменной age + новое.
print("New age:", age,type(age)) # Выведите измененное значение переменной age на экран.
is_student =True # Создайте переменную is_student и присвойте ей значение True (логическое значение).
print("Is Student:",is_student,type(is_student)) # Выведите значение переменной is_student на экран.
